SET NAMES UTF8;
DROP DATABASE IF EXISTS star;
CREATE DATABASE star CHARSET=UTF8;
USE star;
CREATE TABLE user(
    uid INT PRIMARY KEY AUTO_INCREMENT,
    uname VARCHAR(32),
    phone VARCHAR(11),
    upwd VARCHAR(32)
);
INSERT INTO user VALUES
(1,'admin','15013264030','1234567'),
(2,'test@126.com','15013264030','1234567');
CREATE TABLE chanpin(
    no INT PRIMARY KEY AUTO_INCREMENT,
    biaoti VARCHAR(32),
    jine VARCHAR(11),
    shouyi VARCHAR(15),
    qixian VARCHAR(12),
    fangshi VARCHAR(20),
    jindu VARCHAR(10)
);
INSERT INTO chanpin VALUES
(1,'企业贷款','100','10%','12个月','等额本息','50%'),
(2,'企业贷款','90','10%','12个月','等额本息','50%'),
(3,'企业贷款','54','10%','12个月','等额本息','50%'),
(4,'企业贷款','54','10%','12个月','等额本息','50%'),
(5,'企业贷款','45','10%','12个月','等额本息','50%'),
(6,'企业贷款','15','10%','12个月','等额本息','50%'),
(7,'企业贷款','54','10%','12个月','等额本息','50%'),
(8,'企业贷款','65','10%','12个月','等额本息','50%'),
(9,'企业贷款','85','10%','12个月','等额本息','50%'),
(10,'企业贷款','140','10%','12个月','等额本息','50%'),
(11,'企业贷款','14','10%','12个月','等额本息','50%'),
(12,'企业贷款','78','10%','12个月','等额本息','50%'),
(13,'企业贷款','86','10%','12个月','等额本息','50%'),
(14,'企业贷款','145','10%','12个月','等额本息','50%'),
(15,'企业贷款','187','10%','12个月','等额本息','50%'),
(16,'企业贷款','48','10%','12个月','等额本息','50%');

